       *>  Your program reads an input file (P2In.dat). It shows the 
       *>  outputs on an output file (P2Out.dat) and on the screen. 
       *>  The following headings appear on your outputs:
       *>  a. Your name
       *>  b. Student W number
       *>  c. COURSE TITLE, GR, EARNED, QPTS
       *>  d. SEMESTER
       *>  e. CUMULATIVE

       *>  Program-ID: P2.cob
       *>  Author: Paogrammers
       *>  OS: Ubuntu 20
       *>  Compiler: OpenCOBOL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P2.
       PROCEDURE DIVISION.
           DISPLAY "Hello".
           STOP RUN.
      
       *>  Input: No
       *>  Output:
       *>  Hello